---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag.#ctor(Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType,System.String)
source: html/d8e95931-b9d6-2cd2-b5c2-fffea3a1fdfe.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag.#ctor Method

Constructs a new ReinforcementAbbreviationTag.

## Syntax (C#)
```csharp
public ReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType typeTag,
	string abbreviationTag
)
```

## Parameters
- **typeTag** (`Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType`) - Defines the type of abbreviation tag.
- **abbreviationTag** (`System.String`) - Defines the abbreviation tag value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration